balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ16MC101.PIC
        <edc:SFRDef edc:access="nnnn--nnn--n--nn" edc:cname="ODCB" edc:desc="" edc:impl="0xf393" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--000--0--00" edc:name="ODCB" edc:nzwidth="0x10" edc:por="0000--000--0--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCB0" edc:desc="" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB1" edc:desc="" edc:mask="0x1" edc:name="ODCB1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODCB4" edc:desc="" edc:mask="0x1" edc:name="ODCB4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODCB7" edc:desc="" edc:mask="0x1" edc:name="ODCB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB8" edc:desc="" edc:mask="0x1" edc:name="ODCB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB9" edc:desc="" edc:mask="0x1" edc:name="ODCB9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODCB12" edc:desc="" edc:mask="0x1" edc:name="ODCB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB13" edc:desc="" edc:mask="0x1" edc:name="ODCB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB14" edc:desc="" edc:mask="0x1" edc:name="ODCB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB15" edc:desc="" edc:mask="0x1" edc:name="ODCB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCB" edc:desc="" edc:mask="0xffff" edc:name="ODCB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="44"/>
        <edc:SFRDef edc:access="--------------n-" edc:cname="PADCFG1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------0-" edc:name="PADCFG1" edc:nzwidth="16" edc:por="--------------0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTSECSEL" edc:desc="" edc:mask="0x1" edc:name="RTSECSEL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2a" edc:modsrc="DOS-01041.Module">
          <edc:ModuleExclude edc:impl="0xebef" edc:offset="0x20"/>
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x2c" edc:end="0x2e" edc:modsrc="DOS-01041.Module">
          <edc:ModuleExclude edc:impl="0xf" edc:offset="0x2c"/>
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:Module_ref edc:begin="0x30" edc:end="0x32" edc:modsrc="DOS-01041.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xf" edc:offset="0x30"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x6" edc:modsrc="DOS-01293.Module"/>
        <edc:AdjustPoint edc:offset="736"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x8" edc:modsrc="DOS-00828.Module"/>
        <edc:AdjustPoint edc:offset="40"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xffef" edc:offset="0x2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x4" edc:end="0xc" edc:modsrc="DOS-01080.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleExclude edc:impl="0xefff" edc:offset="0x4"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:SFRDef edc:access="---nnnnn--------" edc:cname="RPINR0" edc:desc="" edc:impl="0x1f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111--------" edc:name="RPINR0" edc:nzwidth="0x10" edc:por="---11111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="INT1R" edc:desc="" edc:mask="0x1f" edc:name="INT1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="INT1R0" edc:desc="" edc:mask="0x1" edc:name="INT1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R1" edc:desc="" edc:mask="0x1" edc:name="INT1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R2" edc:desc="" edc:mask="0x1" edc:name="INT1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R3" edc:desc="" edc:mask="0x1" edc:name="INT1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R4" edc:desc="" edc:mask="0x1" edc:name="INT1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR1" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2R" edc:desc="" edc:mask="0x1f" edc:name="INT2R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2R0" edc:desc="" edc:mask="0x1" edc:name="INT2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R1" edc:desc="" edc:mask="0x1" edc:name="INT2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R2" edc:desc="" edc:mask="0x1" edc:name="INT2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R3" edc:desc="" edc:mask="0x1" edc:name="INT2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R4" edc:desc="" edc:mask="0x1" edc:name="INT2R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR3" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR3" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CKR" edc:desc="" edc:mask="0x1f" edc:name="T2CKR" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="T3CKR" edc:desc="" edc:mask="0x1f" edc:name="T3CKR" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2CKR0" edc:desc="" edc:mask="0x1" edc:name="T2CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR1" edc:desc="" edc:mask="0x1" edc:name="T2CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR2" edc:desc="" edc:mask="0x1" edc:name="T2CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR3" edc:desc="" edc:mask="0x1" edc:name="T2CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR4" edc:desc="" edc:mask="0x1" edc:name="T2CKR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="T3CKR0" edc:desc="" edc:mask="0x1" edc:name="T3CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR1" edc:desc="" edc:mask="0x1" edc:name="T3CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR2" edc:desc="" edc:mask="0x1" edc:name="T3CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR3" edc:desc="" edc:mask="0x1" edc:name="T3CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKR4" edc:desc="" edc:mask="0x1" edc:name="T3CKR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR7" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR7" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC1R" edc:desc="" edc:mask="0x1f" edc:name="IC1R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IC2R" edc:desc="" edc:mask="0x1f" edc:name="IC2R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IC1R0" edc:desc="" edc:mask="0x1" edc:name="IC1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R1" edc:desc="" edc:mask="0x1" edc:name="IC1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R2" edc:desc="" edc:mask="0x1" edc:name="IC1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R3" edc:desc="" edc:mask="0x1" edc:name="IC1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1R4" edc:desc="" edc:mask="0x1" edc:name="IC1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IC2R0" edc:desc="" edc:mask="0x1" edc:name="IC2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R1" edc:desc="" edc:mask="0x1" edc:name="IC2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R2" edc:desc="" edc:mask="0x1" edc:name="IC2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R3" edc:desc="" edc:mask="0x1" edc:name="IC2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2R4" edc:desc="" edc:mask="0x1" edc:name="IC2R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR8" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR8" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IC3R" edc:desc="" edc:mask="0x1f" edc:name="IC3R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IC3R0" edc:desc="" edc:mask="0x1" edc:name="IC3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R1" edc:desc="" edc:mask="0x1" edc:name="IC3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R2" edc:desc="" edc:mask="0x1" edc:name="IC3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R3" edc:desc="" edc:mask="0x1" edc:name="IC3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC3R4" edc:desc="" edc:mask="0x1" edc:name="IC3R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR11" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------xxxxx" edc:name="RPINR11" edc:nzwidth="0x10" edc:por="-----------xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0x1f" edc:name="OCFAR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCFAR0" edc:desc="" edc:mask="0x1" edc:name="OCFAR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCFAR1" edc:desc="" edc:mask="0x1" edc:name="OCFAR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCFAR2" edc:desc="" edc:mask="0x1" edc:name="OCFAR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCFAR3" edc:desc="" edc:mask="0x1" edc:name="OCFAR3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCFAR4" edc:desc="" edc:mask="0x1" edc:name="OCFAR4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR18" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR18" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0x1f" edc:name="U1RXR" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1CTSR" edc:desc="" edc:mask="0x1f" edc:name="U1CTSR" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXR0" edc:desc="" edc:mask="0x1" edc:name="U1RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR1" edc:desc="" edc:mask="0x1" edc:name="U1RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR2" edc:desc="" edc:mask="0x1" edc:name="U1RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR3" edc:desc="" edc:mask="0x1" edc:name="U1RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR4" edc:desc="" edc:mask="0x1" edc:name="U1RXR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1CTSR0" edc:desc="" edc:mask="0x1" edc:name="U1CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR1" edc:desc="" edc:mask="0x1" edc:name="U1CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR2" edc:desc="" edc:mask="0x1" edc:name="U1CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR3" edc:desc="" edc:mask="0x1" edc:name="U1CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR4" edc:desc="" edc:mask="0x1" edc:name="U1CTSR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR21" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR21" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0x1f" edc:name="SS1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SS1R0" edc:desc="" edc:mask="0x1" edc:name="SS1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R1" edc:desc="" edc:mask="0x1" edc:name="SS1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R2" edc:desc="" edc:mask="0x1" edc:name="SS1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R3" edc:desc="" edc:mask="0x1" edc:name="SS1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R4" edc:desc="" edc:mask="0x1" edc:name="SS1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR0" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="RPOR0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP0R" edc:desc="" edc:mask="0x1f" edc:name="RP0R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP1R" edc:desc="" edc:mask="0x1f" edc:name="RP1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP0R0" edc:desc="" edc:mask="0x1" edc:name="RP0R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R1" edc:desc="" edc:mask="0x1" edc:name="RP0R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R2" edc:desc="" edc:mask="0x1" edc:name="RP0R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R3" edc:desc="" edc:mask="0x1" edc:name="RP0R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R4" edc:desc="" edc:mask="0x1" edc:name="RP0R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP1R0" edc:desc="" edc:mask="0x1" edc:name="RP1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R1" edc:desc="" edc:mask="0x1" edc:name="RP1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R2" edc:desc="" edc:mask="0x1" edc:name="RP1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R3" edc:desc="" edc:mask="0x1" edc:name="RP1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R4" edc:desc="" edc:mask="0x1" edc:name="RP1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPOR2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----00000000" edc:name="RPOR2" edc:nzwidth="0x10" edc:por="000-----00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP4R" edc:desc="" edc:mask="0x1f" edc:name="RP4R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP4R0" edc:desc="" edc:mask="0x1" edc:name="RP4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R1" edc:desc="" edc:mask="0x1" edc:name="RP4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R2" edc:desc="" edc:mask="0x1" edc:name="RP4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R3" edc:desc="" edc:mask="0x1" edc:name="RP4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R4" edc:desc="" edc:mask="0x1" edc:name="RP4R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn--------" edc:cname="RPOR3" edc:desc="" edc:impl="0x1f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000-----" edc:name="RPOR3" edc:nzwidth="0x10" edc:por="00000000000-----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP7R" edc:desc="" edc:mask="0x1f" edc:name="RP7R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP7R0" edc:desc="" edc:mask="0x1" edc:name="RP7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R1" edc:desc="" edc:mask="0x1" edc:name="RP7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R2" edc:desc="" edc:mask="0x1" edc:name="RP7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R3" edc:desc="" edc:mask="0x1" edc:name="RP7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R4" edc:desc="" edc:mask="0x1" edc:name="RP7R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
